{
  "backend/main.mo": "Stores inquiries in a list, supports submitting, listing (sorted by timestamp), and deleting inquiries by timestamp.",
  "feature_evidence.json": "Defines feature evidence for replacing the founder photo, including affected files, components, and metadata.",
  "frontend-file-summaries.txt": "Contains pre-written summaries of key frontend files such as styles, components, pages, and hooks.",
  "frontend/index.css": "Configures global Tailwind layers and custom CSS variables for light/dark themes and layout styling.",
  "frontend/index.html": "Basic HTML shell with a root div and script loading the React entry point.",
  "frontend/src/App.tsx": "Sets up TanStack Router with root layout, home and admin routes, and renders header, footer, and toast system.",
  "frontend/src/components/ContactForm.tsx": "Implements a validated contact form with async inquiry submission, error handling, and success messaging.",
  "frontend/src/components/FaqAccordion.tsx": "Displays a list of frequently asked questions using an accordion UI component.",
  "frontend/src/components/FoundersSection.tsx": "Renders three founder profiles with circular images, names, and roles in a card grid.",
  "frontend/src/components/PricingCards.tsx": "Shows two pricing plans with features and a CTA button that scrolls to the contact section.",
  "frontend/src/components/ProgramsSection.tsx": "Renders a programs section with three level cards and a shared features card using Tailwind and UI components.",
  "frontend/src/components/SiteFooter.tsx": "Displays the site footer with branding, navigation links, contact info, and social icons.",
  "frontend/src/components/SiteHeader.tsx": "Implements a responsive site header with logo, navigation buttons, smooth scroll, and mobile menu.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identity loading, and identity state management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and submitting inquiries through the actor API.",
  "frontend/src/index.css": "Configures Tailwind layers and defines CSS variables for light and dark themes with custom brand colors.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin page that fetches and displays contact inquiries with loading, error, and empty states in a table format.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero, features, programs, pricing, FAQ, and contact sections, including smooth-scroll actions and promotional content.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugin usage for styling the site.",
  "project_state.json": "Project metadata describing features, requirements, image tasks, and current build state for the English Discovery 2.0 website."
}