{
  "backend/main.mo": "Backend actor managing website content, user profiles, inquiries, photos, FAQ items, and admin password with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence record describing a modification to swap displayed founder names in FoundersSection.tsx.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for numerous frontend files used as reference.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables, dark mode tokens, and global border/background application.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with root, home, and admin routes wrapped in a shared layout.",
  "frontend/src/components/ContactForm.tsx": "Contact form with validation, success/error state handling, and inquiry submission via React Query.",
  "frontend/src/components/FaqAccordion.tsx": "Static FAQ accordion listing eight common questions using shadcn accordion components.",
  "frontend/src/components/FoundersSection.tsx": "Renders three founder cards with swapped names for Saloni and Sumit, loading photos from backend with fallbacks.",
  "frontend/src/components/PricingCards.tsx": "Renders pricing plan cards with features and a button that scrolls to the contact section.",
  "frontend/src/components/ProgramsSection.tsx": "Displays program level cards and a shared-features card with lists of skills and benefits.",
  "frontend/src/components/SiteFooter.tsx": "Provides a footer with branding, navigation shortcuts, contact links, and dynamic YouTube URL.",
  "frontend/src/components/SiteHeader.tsx": "Implements a responsive header with navigation, mobile menu, and YouTube link using scroll-to-section logic.",
  "frontend/src/constants/contact.ts": "Exports shared constants for public contact email and phone.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAdminPassword.ts": "Defines hooks for checking, setting, verifying, and resetting the admin password via actor methods.",
  "frontend/src/hooks/useAdminSession.ts": "Manages persisted admin authentication state using Zustand.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context and helpers for login state, identity loading, and AuthClient setup.",
  "frontend/src/hooks/usePhotos.ts": "Provides React Query hooks to list, fetch, add, update, and delete photos through the backend actor, with cache invalidation and upload progress support.",
  "frontend/src/hooks/useQueries.ts": "Defines hooks for fetching inquiries, checking admin status, and submitting new inquiries using the backend actor and React Query.",
  "frontend/src/hooks/useWebsiteContent.ts": "Offers hooks to fetch and update website content via the backend actor with React Query cache updates.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables, themes, and utility classes for layout and styling.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClientProvider and InternetIdentityProvider, rendering the main App component.",
  "frontend/src/pages/AdminPage.tsx": "Implements the admin dashboard with password management, inquiry viewing, photo management, and website content editing.",
  "frontend/src/pages/HomePage.tsx": "Renders the public homepage including hero content, features, program sections, pricing, FAQs, and contact form using dynamic content and photos.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom fonts, OKLCH-based color system, extended animations, and plugins for typography, container queries, and animation.",
  "project_state.json": "Project metadata describing current state, existing features, and a pending request to swap two displayed team member names."
}